zdavatz/fp-sns-stbox1/Middlewares/ST/STM32WB07_06/hci/stm32wb07_06_events_cb.c
/**
  ******************************************************************************
  * @file    stm32wb07_06_events_cb.c
  * @author  System Research & Applications Team - Agrate/Catania Lab.
  * @version 1.0.0
  * @date    04-March-2025
  * @brief   Event callbacks for external uC - stm32wb07_06 in network coprocessor
  *          mode
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

#include "compiler.h"
#include "stm32wb07_06_events.h"

#include "stm32wb07_06_conf.h"
/**
  * @brief The Disconnection Complete event occurs when a connection is terminated.
  *        The status parameter indicates if the disconnection was successful or not. The
  *        reason parameter indicates the reason for the disconnection if the disconnection
  *        was successful. If the disconnection was not successful, the value of the
  *        reason parameter can be ignored by the Host. For example, this can be the
  *        case if the Host has issued the Disconnect command and there was a parameter
  *        error, or the command was not presently allowed, or a connection_handle
  *        that didn't correspond to a connection was given.
  * @param status For standard error codes see Bluetooth specification, Vol. 2, part D.
  *        For proprietary error code refer to Error codes section
  * @param connection_handle connection_handle which was disconnected.
  * Values:
  - 0x0000 ... 0x0EFF
  * @param reason reason for disconnection.
  * Values:
  - 0x00: Success
  - 0x01: Unknown HCI Command
  - 0x02: Unknown Connection Identifier
  - 0x03: Hardware Failure
  - 0x04: Page Timeout
  - 0x05: Authentication Failure
  - 0x06: PIN or Key Missing
  - 0x07: Memory Capacity Exceeded
  - 0x08: Connection Timeout
  - 0x09: Connection Limit Exceeded
  - 0x0A: Synchronous Connection Limit to a Device Exceeded
  - 0x0B: ACL Connection Already Exists
  - 0x0C: Command Disallowed
  - 0x0D: Connection Rejected Due To Limited Resources
  - 0x0E: Connection Rejected Due To Security Reasons
  - 0x0F: Connection Rejected due to Unacceptable BD_ADDR
  - 0x10: Connection Accept Timeout Exceeded
  - 0x11: Unsupported Feature Or Parameter Value
  - 0x12: Invalid HCI Command Parameters
  - 0x13: Remote User Terminated Connection
  - 0x14: Remote Device Terminated Connection due to Low Resources
  - 0x15: Remote Device Terminated Connection due to Power Off
  - 0x16: Connection Terminated By Local Host
  - 0x17: Repeated Attempts
  - 0x18: Pairing Not Allowed
  - 0x19: Unknown LMP PDU
  - 0x1A: Unsupported Remote Feature / Unsupported LMP Feature
  - 0x1B: SCO Offset Rejected
  - 0x1C: SCO Interval Rejected
  - 0x1D: SCO Air Mode Rejected
  - 0x1E: Invalid LMP Parameters
  - 0x1F: Unspecified Error
  - 0x20: Unsupported LMP Parameter Value
  - 0x21: Role Change Not Allowed
  - 0x22: LMP Response Timeout / LL Response Timeout
  - 0x23: LMP Error Transaction Collision
  - 0x24: LMP PDU Not Allowed
  - 0x25: Encryption Mode Not Acceptable
  - 0x26: Link Key cannot be Changed
  - 0x27: Requested QoS Not Supported
  - 0x28: Instant Passed
  - 0x29: Pairing With Unit Key Not Supported
  - 0x2A: Different Transaction Collision
  - 0x2C: QoS Unacceptable Parameter
  - 0x2D: QoS Rejected
  - 0x2E: Channel Assessment Not Supported
  - 0x2F: Insufficient Security
  - 0x30: Parameter Out Of Mandatory Range
  - 0x32: Role Switch Pending
  - 0x34: Reserved Slot Violation
  - 0x35: Role Switch Failed
  - 0x36: Extended Inquiry Response Too Large
  - 0x37: Secure Simple Pairing Not Supported by Host
  - 0x38: Host Busy - Pairing
  - 0x39: Connection Rejected due to No Suitable Channel Found
  - 0x3A: Controller Busy
  - 0x3B: Unacceptable Connection Interval
  - 0x3C: Directed Advertising Timeout
  - 0x3D: Connection Terminated Due to MIC Failure
  - 0x3E: Connection Failed to be Established
  - 0x3F: MAC of the 802.11 AMP
  - 0x41: Failed
  - 0x42: Invalid parameters
  - 0x43: Busy
  - 0x44: Invalid length
  - 0x45: Pending
  - 0x46: Not allowed
  - 0x47: GATT error
  - 0x48: Address not resolved
  - 0x50: Invalid CID
  - 0x5A: CSRK not found
  - 0x5B: IRK not found
  - 0x5C: Device not found in DB
  - 0x5D: Security DB full
  - 0x5E: Device not bonded
  - 0x5F: Device in blacklist
  - 0x60: Invalid handle
  - 0x61: Invalid parameter
  - 0x62: Out of handles
  - 0x63: Invalid operation
  - 0x64: Insufficient resources
  - 0x65: Insufficient encryption key size
  - 0x66: Characteristic already exist
  - 0x82: No valid slot
  - 0x83: Short window
  - 0x84: New interval failed
  - 0x85: Too large interval
  - 0x86: Slot length failed
  - 0xFA: Flash read failed
  - 0xFB: Flash write failed
  - 0xFC: Flash erase failed
  * @retval None
  */
WEAK_FUNCTION(void hci_disconnection_complete_event(uint8_t status,
                                                    uint16_t connection_handle,
                                                    uint8_t reason))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB07_06_PRINTF("hci_disconnection_complete_event\r\n");

}
/**
  * @brief The Encryption Change event is used to indicate that the change of the encryption
  *        mode has been completed. The connection_handle will be a connection_handle
  *        for an ACL connection. The encryption_enabled event parameter
  *        specifies the new encryption_enabled parameter for the connection_handle
  *        specified by the connection_handle event parameter. This event will occur on
  *        both devices to notify the Hosts when Encryption has changed for the specified
  *        connection_handle between two devices. Note: This event shall not be generated
  *        if encryption is paused or resumed; during a role switch, for example.
  *        The meaning of the encryption_enabled parameter depends on whether the
  *        Host has indicated support for Secure Connections in the Secure_Connections_Host_Support
  *        parameter. When Secure_Connections_Host_Support is
  *        'disabled' or the connection_handle refers to an LE link, the Controller shall
  *        only use encryption_enabled values 0x00 (OFF) and 0x01 (ON).
  *        (See Bluetooth Specification v.4.1, Vol. 2, Part E, 7.7.8)
  * @param status For standard error codes see Bluetooth specification, Vol. 2, part D.
  *        For proprietary error code refer to Error codes section
  * @param connection_handle Connection handle for which the command is given.
  * Values:
  - 0x0000 ... 0x0EFF
  * @param encryption_enabled Link Level Encryption.
  * Values:
  - 0x00: Link Level Encryption OFF
  - 0x01: Link Level Encryption is ON with AES-CCM
  * @retval None
  */
WEAK_FUNCTION(void hci_encryption_change_event(uint8_t status,
                                               uint16_t connection_handle,
                                               uint8_t encryption_enabled))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB07_06_PRINTF("hci_encryption_change_event\r\n");
}
/**
  * @brief The Read Remote Version Information Complete event is used to indicate the
  *        completion of the process obtaining the version information of the remote Controller
  *        specified by the connection_handle event parameter. The connection_handle
  *        shall be for an ACL connection.
  *        The Version event parameter defines the specification version of the LE Controller.
  *        The manufacturer_name event parameter indicates the manufacturer
  *        of the remote Controller. The Subversion event parameter is controlled
  *        by the manufacturer and is implementation dependent. The Subversion
  *        event parameter defines the various revisions that each version of the Bluetooth
  *        hardware will go through as design processes change and errors are
  *        fixed. This allows the software to determine what Bluetooth hardware is being
  *        used and, if necessary, to work around various bugs in the hardware.
  *        When the connection_handle is associated with an LE-U logical link, the Version
  *        event parameter shall be Link Layer VersNr parameter, the manufacturer_name
  *        event parameter shall be the CompId parameter, and the Subversion
  *        event parameter shall be the SubVersNr parameter.
  *        (See Bluetooth Specification v.4.1, Vol. 2, Part E, 7.7.12)
  * @param status For standard error codes see Bluetooth specification, Vol. 2, part D.
  *        For proprietary error code refer to Error codes section
  * @param connection_handle Connection handle for which the command is given.
  * Values:
  - 0x0000 ... 0x0EFF
  * @param version Version of the Current LMP in the remote Controller
  * @param manufacturer_name Manufacturer Name of the remote Controller
  * @param subversion Subversion of the LMP in the remote Controller
  * @retval None
  */
WEAK_FUNCTION(void hci_read_remote_version_information_complete_event(uint8_t status,
                                                                      uint16_t connection_handle,
                                                                      uint8_t version,
                                                                      uint16_t manufacturer_name,
                                                                      uint16_t subversion))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB07_06_PRINTF("hci_read_remote_version_information_complete_event\r\n");
}
/**
  * @brief The Hardware Error event is used to indicate some implementation specific type of hardware
  *        failure for the controller. This event is used to notify the Host that a hardware failure
  *        has occurred in the Controller.
  * @param hardware_code Hardware Error Event code.
  *        Error code 0x01 and 0x02 are errors generally caused by hardware issue on the PCB;
  *        another possible cause is a slow crystal startup.
  *        In the latter case, the HS_STARTUP_TIME in the device configuration needs to be tuned.
  *        Error code 0x03 indicates an internal error of the protocol stack.
  *        After this event is recommended to force device reset.
  *        Values:
  *        0x01: Radio state error
  *        0x02: Timer overrun error
  *        0x03: Internal queue overflow error
  * @retval None
  */
WEAK_FUNCTION(void hci_hardware_error_event(uint8_t hardware_code))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB07_06_PRINTF("hci_hardware_error_event\r\n");
}
/**
  * @brief 'The Number Of Completed Packets event is used by the Controller to indicate
  *        to the Host how many HCI Data Packets have been completed (transmitted or
  *        flushed) for each connection_handle since the previous Number Of Completed
  *        Packets event was sent to the Host. This means that the corresponding
  *        buffer space has been freed in the Controller. Based on this information, and
  *        the HC_Total_Num_ACL_Data_Packets and HC_Total_Num_Synchronous_-
  *        Data_Packets return parameter of the Read_Buffer_Size command, the Host
  *        can determine for which Connection_Handles the following HCI Data Packets
  *        should be sent to the Controller. The Number Of Completed Packets event
  *        must not be sent before the corresponding Connection Complete event. While
  *        the Controller has HCI data packets in its buffer, it must keep sending the Number
  *        Of Completed Packets event to the Host at least periodically, until it finally
  *        reports that all the pending ACL Data Packets have been transmitted or
  *        flushed.
  * @param number_of_handles The number of Connection_Handles and Num_HCI_Data_Packets parameters
  *        pairs contained in this event
  * @param handle_packets_pair_entry See @ref handle_packets_pair_entry_t
  * @retval None
  */
WEAK_FUNCTION(void hci_number_of_completed_packets_event(uint8_t number_of_handles,
                                                         handle_packets_pair_entry_t handle_packets_pair_entry[]))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB07_06_PRINTF("hci_number_of_completed_packets_event\r\n");
}
/**
  * @brief 'This event is used to indicate that the Controller's data buffers have been overflowed.
  *        This can occur if the Host has sent more packets than allowed. The
  *        link_type parameter is used to indicate that the overflow was caused by ACL data.
  * @param link_type On which type of channel overflow has occurred.
  *        Values:
  *        - 0x01: ACL Buffer Overflow
  * @retval None
  */
WEAK_FUNCTION(void hci_data_buffer_overflow_event(uint8_t link_type))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB07_06_PRINTF("hci_data_buffer_overflow_event\r\n");
}
/**
  * @brief 'The Encryption Key Refresh Complete event is used to indicate to the Host
  *        that the encryption key was refreshed on the given connection_handle any
  *        time encryption is paused and then resumed.
  *        If the Encryption Key Refresh Complete event was generated due to an
  *        encryption pause and resume operation embedded within a change connection
  *        link key procedure, the Encryption Key Refresh Complete event shall be sent
  *        prior to the Change Connection Link Key Complete event.
  *        If the Encryption Key Refresh Complete event was generated due to an
  *        encryption pause and resume operation embedded within a role switch procedure,
  *        the Encryption Key Refresh Complete event shall be sent prior to the
  *        Role Change event.
  * @param status For standard error codes see Bluetooth specification, Vol. 2, part D.
  *        For proprietary error code refer to Error codes section
  * @param connection_handle Connection handle for which the command is given.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @retval None
  */
WEAK_FUNCTION(void hci_encryption_key_refresh_complete_event(uint8_t status,
                                                             uint16_t connection_handle))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB07_06_PRINTF("hci_encryption_key_refresh_complete_event\r\n");
}

/**
  * @brief The HCI_Authenticated_Payload_Timeout_Expired event is used to
  *        indicate that a packet containing a valid MIC on the connection_handle
  *        was not received within the authenticatedPayloadTO. Note: A Host may
  *        choose to disconnect the link when this occurs.
  * @param connection_handle Connection handle that identifies the connection.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @retval None
  */
WEAK_FUNCTION(void hci_authenticated_payload_timeout_expired_event(uint16_t onnection_Handle))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB07_06_PRINTF("hci_authenticated_payload_timeout_expired_event\r\n");
}

