zdavatz/fp-sns-stbox1/Middlewares/ST/STM32WB07_06/hci/stm32wb07_06_events_cb.c
/**
  * @brief The LE Connection Complete event indicates to both of the Hosts forming the
  *        connection that a new connection has been created. Upon the creation of the
  *        connection a connection_handle shall be assigned by the Controller, and
  *        passed to the Host in this event. If the connection establishment fails this event
  *        shall be provided to the Host that had issued the LE_Create_Connection command.
  *        This event indicates to the Host which issued a LE_Create_Connection
  *        command and received a Command status event if the connection
  *        establishment failed or was successful.
  *        The master_clock_accuracy parameter is only valid for a slave. On a master,
  *        this parameter shall be set to 0x00.
  * @param status For standard error codes see Bluetooth specification, Vol. 2, part D.
  *               For proprietary error code refer to Error codes section
  * @param connection_handle Connection handle to be used to identify the connection with the peer device.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @param role Role of the local device in the connection.
  *        Values:
  *        - 0x00: Master
  *        - 0x01: Slave
  * @param peer_address_type The address type of the peer device.
  *        Values:
  *        - 0x00: Public Device Address
  *        - 0x01: Random Device Address
  * @param peer_address Public Device Address or Random Device Address of the peer device
  * @param conn_interval Connection interval used on this connection.
  *        Time = N * 1.25 msec
  *        Values:
  *        - 0x0006 (7.50 ms)  ... 0x0C80 (4000.00 ms)
  * @param conn_latency Slave latency for the connection in number of connection events.
  *        Values:
  *        - 0x0000 ... 0x01F3
  * @param supervision_timeout Supervision timeout for the LE Link.
  *        It shall be a multiple of 10 ms and larger than (1 + connSlaveLatency) * connInterval * 2.
  *        Time = N * 10 msec.
  *        Values:
  - 0x000A (100 ms)  ... 0x0C80 (32000 ms)
  * @param master_clock_accuracy Master clock accuracy. Only valid for a slave.
  *        Values:
  *        - 0x00: 500 ppm
  *        - 0x01: 250 ppm
  *        - 0x02: 150 ppm
  *        - 0x03: 100 ppm
  *        - 0x04: 75 ppm
  *        - 0x05: 50 ppm
  *        - 0x06: 30 ppm
  *        - 0x07: 20 ppm
  * @retval None
  */
WEAK_FUNCTION(void hci_le_connection_complete_event(uint8_t status,
                                                    uint16_t connection_handle,
                                                    uint8_t role,
                                                    uint8_t peer_address_type,
                                                    uint8_t peer_address[6],
                                                    uint16_t conn_interval,
                                                    uint16_t conn_latency,
                                                    uint16_t supervision_timeout,
                                                    uint8_t master_clock_accuracy))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB07_06_PRINTF("hci_le_connection_complete_event\r\n");
}
/**
  * @brief The LE Advertising Report event indicates that a Bluetooth device or multiple
  *        Bluetooth devices have responded to an active scan or received some information
  *        during a passive scan. The Controller may queue these advertising reports
  *        and send information from multiple devices in one LE Advertising Report event.
  * @param num_reports Number of responses in this event.
  *        Values:
  *        - 0x01
  * @param advertising_report See @ref advertising_report_t
  * @retval None
  */
WEAK_FUNCTION(void hci_le_advertising_report_event(uint8_t num_reports,
                                                   advertising_report_t advertising_report[]))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB07_06_PRINTF("hci_le_advertising_report_event\r\n");
}
/**
  * @brief The LE Connection Update Complete event is used to indicate that the Controller
  *        process to update the connection has completed.
  *        On a slave, if no connection parameters are updated, then this event shall not be issued.
  *        On a master, this event shall be issued if the Connection_Update command was sent.
  * @param status For standard error codes see Bluetooth specification, Vol. 2, part D.
  *               For proprietary error code refer to Error codes section
  * @param connection_handle Connection handle to be used to identify the connection with the peer device.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @param conn_interval Connection interval used on this connection.
  *        Time = N * 1.25 msec
  *        Values:
  *        - 0x0006 (7.50 ms)  ... 0x0C80 (4000.00 ms)
  * @param conn_latency Slave latency for the connection in number of connection events.
  *        Values:
  *        - 0x0000 ... 0x01F3
  * @param supervision_timeout Supervision timeout for the LE Link.
  *        It shall be a multiple of 10 ms and larger than (1 + connSlaveLatency) * connInterval * 2.
  *        Time = N * 10 msec.
  *        Values:
  *        - 0x000A (100 ms)  ... 0x0C80 (32000 ms)
  * @retval None
  */
WEAK_FUNCTION(void hci_le_connection_update_complete_event(uint8_t status,
                                                           uint16_t connection_handle,
                                                           uint16_t conn_interval,
                                                           uint16_t conn_latency,
                                                           uint16_t supervision_timeout))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB07_06_PRINTF("hci_le_connection_update_complete_event\r\n");
}
/**
  * @brief The LE Read Remote Used Features Complete event is used to indicate the
  *        completion of the process of the Controller obtaining the used features of the
  *        remote Bluetooth device specified by the connection_handle event parameter.
  * @param status For standard error codes see Bluetooth specification, Vol. 2, part D.
  *               For proprietary error code refer to Error codes section
  * @param connection_handle Connection handle to be used to identify the connection with the peer device.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @param le_features Bit Mask List of used LE features. For details see LE Link Layer specification.
  * @retval None
  */
WEAK_FUNCTION(void hci_le_read_remote_used_features_complete_event(uint8_t status,
                                                                   uint16_t connection_handle,
                                                                   uint8_t le_features[8]))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB07_06_PRINTF("hci_le_read_remote_used_features_complete_event\r\n");
}
/**
  * @brief The LE Long Term Key Request event indicates that the master device is
  *        attempting to encrypt or re-encrypt the link and is requesting the Long Term
  *        Key from the Host. (See [Vol 6] Part B, Section 5.1.3).
  * @param connection_handle Connection handle to be used to identify the connection with the peer device.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @param random_number 64-bit random number
  * @param encrypted_diversifier 16-bit encrypted diversifier
  * @retval None
  */
WEAK_FUNCTION(void hci_le_long_term_key_request_event(uint16_t connection_handle,
                                                      uint8_t random_number[8],
                                                      uint16_t encrypted_diversifier))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB07_06_PRINTF("hci_le_long_term_key_request_event\r\n");
}
/**
  * @brief The LE Data Length Change event notifies the Host of a change to either the maximum Payload length
  *        or the maximum transmission time of Data Channel PDUs in either direction.
  *        The values reported are the maximum that will actually be used on the connection following the change.
  * @param connection_handle connection_handle to be used to identify a connection.
  * @param max_tx_octets The maximum number of payload octets in a Link Layer Data Channel PDU that the local
  *                      Controller will send on this connection
  *                      (connEffectiveMaxTxOctets defined in [Vol 6] Part B, Section 4.5.10).
  *                      Range 0x001B-0x00FB (0x0000 - 0x001A and 0x00FC - 0xFFFF Reserved for future use)
  * @param max_tx_time The maximum time that the local Controller will take to send a Link Layer Data Channel PDU
  *                    on this connection (connEffectiveMaxTx-Time defined in [Vol 6] Part B, Section 4.5.10).
  *                    Range 0x0148-0x0848 (0x0000 - 0x0127 and 0x0849 - 0xFFFF Reserved for future use)
  * @param max_rx_octets The maximum number of payload octets in a Link Layer Data Channel PDU that the local
  *                      controller expects to receive on this connection
  *                      (connEfectiveMaxRxOctets defined in [Vol 6] Part B, Section 4.5.10).
  *                      Range 0x001B-0x00FB (0x0000 - 0x001A and 0x00FC - 0xFFFF Reserved for future use)
  * @param max_rx_time The maximum time that the local Controller expects to take to receive a Link Layer Data Channel
  *                    PDU on this connection (connEffectiveMax-RxTime defined in [Vol 6] Part B, Section 4.5.10).
  *                    Range 0x0148-0x0848 (0x0000 - 0x0127 and 0x0849 - 0xFFFF Reserved for future use)
  * @retval None
  */
WEAK_FUNCTION(void hci_le_data_length_change_event(uint16_t connection_handle,
                                                   uint16_t max_tx_octets,
                                                   uint16_t max_tx_time,
                                                   uint16_t max_rx_octets,
                                                   uint16_t max_rx_time))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB07_06_PRINTF("hci_le_data_length_change_event\r\n");
}
/**
  * @brief This event is generated when local P-256 key generation is complete.
  * @param status For standard error codes see Bluetooth specification,
  *               Vol. 2, part D. For proprietary error code refer to Error codes section
  * @param local_p256_public_key Local P-256 public key.
  * @retval None
  */
WEAK_FUNCTION(void hci_le_read_local_p256_public_key_complete_event(uint8_t status,
                                                                    uint8_t local_p256_public_key[64]))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB07_06_PRINTF("hci_le_read_local_p256_public_key_complete_event\r\n");
}
/**
  * @brief This event indicates that LE Diffie Hellman key generation has been completed
by the Controller.
  * @param status For standard error codes see Bluetooth specification, Vol. 2, part D.
  *               For proprietary error code refer to Error codes section
  * @param dh_key Diffie Hellman Key
  * @retval None
  */
WEAK_FUNCTION(void hci_le_generate_dhkey_complete_event(uint8_t status,
                                                        uint8_t dh_key[32]))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB07_06_PRINTF("hci_le_generate_dhkey_complete_event\r\n");
}
/**
  * @brief The LE Enhanced Connection Complete event indicates to both of the Hosts
  *        forming the connection that a new connection has been created. Upon the
  *        creation of the connection a connection_handle shall be assigned by the
  *        Controller, and passed to the Host in this event. If the connection establishment
  *        fails, this event shall be provided to the Host that had issued the
  *        LE_Create_Connection command.
  *        If this event is unmasked and LE Connection Complete event is unmasked,
  *        only the LE Enhanced Connection Complete event is sent when a new
  *        connection has been completed.
  *        This event indicates to the Host that issued a LE_Create_Connection
  *        command and received a Command status event if the connection
  *        establishment failed or was successful.
  *        The master_clock_accuracy parameter is only valid for a slave. On a master,
  *        this parameter shall be set to 0x00.
  * @param status For standard error codes see Bluetooth specification, Vol. 2, part D.
  *               For proprietary error code refer to Error codes section
  * @param connection_handle Connection handle to be used to identify the connection with the peer device.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @param role Role of the local device in the connection.
  *        Values:
  *        - 0x00: Master
  *        - 0x01: Slave
  * @param peer_address_type
  *        Values:
  *        - 0x00: Public Device Address
  *        - 0x01: Random Device Address
  *        - 0x02: Public Identity Address (Corresponds to Resolved Private Address)
  *        - 0x03: Random (Static) Identity Address (Corresponds to Resolved Private Address)
  * @param peer_address Public Device Address, Random Device Address, Public Identity
  *                     Address or Random (static) Identity Address of the device to be connected.
  * @param local_resolvable_private_address Resolvable Private Address being used by the local device for this
  *                                          connection. This is only valid when the own_address_type is set to
  *                                          0x02 or 0x03. For other own_address_type values, the Controller shall
  *                                          return all zeros.
  * @param peer_resolvable_private_address Resolvable Private Address being used by the peer device for this
  *                                        connection. This is only valid for peer_address_type 0x02 and 0x03.
  *                                        For other peer_address_type values, the Controller shall return all zeros.
  * @param conn_interval Connection interval used on this connection.
  *        Time = N * 1.25 msec
  *        Values:
  *        - 0x0006 (7.50 ms)  ... 0x0C80 (4000.00 ms)
  * @param conn_latency Slave latency for the connection in number of connection events.
  *        Values:
  *        - 0x0000 ... 0x01F3
  * @param supervision_timeout Supervision timeout for the LE Link.
  *                            It shall be a multiple of 10 ms and larger than (1+connSlaveLatency)*connInterval*2.
  *        Time = N * 10 msec.
  *        Values:
  *        - 0x000A (100 ms)  ... 0x0C80 (32000 ms)
  * @param master_clock_accuracy Master clock accuracy. Only valid for a slave.
  *        Values:
  *        - 0x00: 500 ppm
  *        - 0x01: 250 ppm
  *        - 0x02: 150 ppm
  *        - 0x03: 100 ppm
  *        - 0x04: 75 ppm
  *        - 0x05: 50 ppm
  *        - 0x06: 30 ppm
  *        - 0x07: 20 ppm
  * @retval None
  */
WEAK_FUNCTION(void hci_le_enhanced_connection_complete_event(uint8_t status,
                                                             uint16_t connection_handle,
                                                             uint8_t role,
                                                             uint8_t peer_address_type,
                                                             uint8_t peer_address[6],
                                                             uint8_t local_resolvable_private_address[6],
                                                             uint8_t peer_resolvable_private_address[6],
                                                             uint16_t conn_interval,
                                                             uint16_t conn_latency,
                                                             uint16_t supervision_timeout,
                                                             uint8_t master_clock_accuracy))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB07_06_PRINTF("hci_le_enhanced_connection_complete_event\r\n");
}
/**
  * @brief The LE Direct Advertising Report event indicates that directed advertisements
have been received where the advertiser is using a resolvable private address
for the InitA field in the ADV_DIRECT_IND PDU and the
scanning_filter_policy is equal to 0x02 or 0x03, see HCI_LE_Set_Scan_Parameters.
direct_address_type and Direct_Addres is the address the directed
advertisements are being directed to. address_type and Address is the
address of the advertiser sending the directed advertisements.
  * @param num_reports Number of responses in this event.
  * Values:
  - 0x01
  * @param direct_advertising_report See @ref direct_advertising_report_t
  * @retval None
  */
WEAK_FUNCTION(void hci_le_direct_advertising_report_event(uint8_t num_reports,
                                                          direct_advertising_report_t direct_advertising_report[]))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB07_06_PRINTF("hci_le_direct_advertising_report_event\r\n");
}
/**
  * @}
  */
/**
  *@defgroup ACI_GAP_events ACI GAP events
  *@brief ACI GAP events layer.
  *@{
  */
/* ACI GAP events */
/**
  * @brief This event is generated by the controller when the limited discoverable mode ends due to
timeout. The timeout is 180 seconds.
  * @retval None
  */
WEAK_FUNCTION(void aci_gap_limited_discoverable_event(void))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB07_06_PRINTF("aci_gap_limited_discoverable_event\r\n");
}
/**
  * @brief This event is generated when the pairing process has completed successfully or a pairing
procedure timeout has occurred or the pairing has failed. This is to notify the application that
we have paired with a remote device so that it can take further actions or to notify that a
timeout has occurred so that the upper layer can decide to disconnect the link.
  * @param connection_handle Connection handle on which the pairing procedure completed
  * @param status Pairing status
  * Values:
  - 0x00: Success
  - 0x01: Timeout
  - 0x02: Failed
  * @param reason Pairing reason error code
  * Values:
  - 0x00
  - 0x01: PASSKEY_ENTRY_FAILED
  - 0x02: OOB_NOT_AVAILABLE
  - 0x03: AUTH_REQ_CANNOT_BE_MET
  - 0x04: CONFIRM_VALUE_FAILED
  - 0x05: PAIRING_NOT_SUPPORTED
  - 0x06: INSUFF_ENCRYPTION_KEY_SIZE
  - 0x07: CMD_NOT_SUPPORTED
  - 0x08: UNSPECIFIED_REASON
  - 0x09: VERY_EARLY_NEXT_ATTEMPT
  - 0x0A: SM_INVALID_PARAMS
  - 0x0B: SMP_SC_DHKEY_CHECK_FAILED
  - 0x0C: SMP_SC_NUMCOMPARISON_FAILED
  * @retval None
  */
WEAK_FUNCTION(void aci_gap_pairing_complete_event(uint16_t connection_handle,
                                                  uint8_t status,
                                                  uint8_t reason))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB07_06_PRINTF("aci_gap_pairing_complete_event\r\n");
}
/**
  * @brief This event is generated by the Security manager to the application when a passkey is
required for pairing. When this event is received, the application has to respond with the
@ref aci_gap_pass_key_resp command.
  * @param connection_handle Connection handle for which the passkey has been requested.
  * @retval None
  */
WEAK_FUNCTION(void aci_gap_pass_key_req_event(uint16_t connection_handle))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB07_06_PRINTF("aci_gap_pass_key_req_event\r\n");
}
/**
  * @brief This event is generated by the Security manager to the application when the application has
set that authorization is required for reading/writing of attributes. This event will be
generated as soon as the pairing is complete. When this event is received,
@ref aci_gap_authorization_resp command should be used to respond by the application.
  * @param connection_handle Connection handle for which authorization has been requested.
  * @retval None
  */
WEAK_FUNCTION(void aci_gap_authorization_req_event(uint16_t connection_handle))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB07_06_PRINTF("aci_gap_authorization_req_event\r\n");
}
/**
  * @brief This event is generated when the slave security request is successfully sent to the master.
  * @retval None
  */
WEAK_FUNCTION(void aci_gap_slave_security_initiated_event(void))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB07_06_PRINTF("aci_gap_slave_security_initiated_event\r\n");
}
/**
  * @brief This event is generated when a pairing request is issued in response to a slave security
request from a master which has previously bonded with the slave. When this event is
received, the upper layer has to issue the command @ref aci_gap_allow_rebond in order to
allow the slave to continue the pairing process with the master.
  * @retval None
  */
WEAK_FUNCTION(void aci_gap_bond_lost_event(void))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB07_06_PRINTF("aci_gap_bond_lost_event\r\n");
}
/**
  * @brief This event is sent by the GAP to the upper layers when a procedure previously started has
  *        been terminated by the upper layer or has completed for any other reason
  * @param procedure_code Terminated procedure.
  * Values:
  - 0x01: LIMITED_DISCOVERY_PROC
  - 0x02: GENERAL_DISCOVERY_PROC
  - 0x04: NAME_DISCOVERY_PROC
  - 0x08: AUTO_CONNECTION_ESTABLISHMENT_PROC
  - 0x10: GENERAL_CONNECTION_ESTABLISHMENT_PROC
  - 0x20: SELECTIVE_CONNECTION_ESTABLISHMENT_PROC
  - 0x40: DIRECT_CONNECTION_ESTABLISHMENT_PROC
  - 0x80: OBSERVATION_PROC
  * @param status For standard error codes see Bluetooth specification,
  *               Vol. 2, part D. For proprietary error code refer to Error codes section
  * @param data_length Length of Data in octets
  * @param data Procedure Specific Data:
- For Name Discovery Procedure: the name of the peer device if the procedure completed successfully.
  * @retval None
  */
WEAK_FUNCTION(void aci_gap_proc_complete_event(uint8_t procedure_code,
                                               uint8_t status,
                                               uint8_t data_length,
                                               uint8_t data[]))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB07_06_PRINTF("aci_gap_proc_complete_event\r\n");
}
/**
  * @brief This event is sent only by a privacy enabled Peripheral. The event is sent to the
upper layers when the peripheral is unsuccessful in resolving the resolvable
address of the peer device after connecting to it.
