zdavatz/fp-sns-stbox1/Middlewares/ST/STM32WB07_06/hci/stm32wb07_06_events_cb.c
  * @param connection_handle Connection handle for which the private address could not be
resolved with any of the stored IRK's.
  * @retval None
  */
WEAK_FUNCTION(void aci_gap_addr_not_resolved_event(uint16_t connection_handle))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB07_06_PRINTF("aci_gap_addr_not_resolved_event\r\n");
}
/**
  * @brief This event is sent only during SC v.4.2 Pairing, when Numeric Comparison Association model is selected,
  *        in order to show the Numeric Value generated, and to ask for Confirmation to the User. When this event
  *        is received, the application has to respond with the
  * @ref aci_gap_numeric_comparison_value_confirm_yesno command
  * @param connection_handle Connection handle related to the underlying Pairing
  * @param numeric_value
  * @retval None
  */
WEAK_FUNCTION(void aci_gap_numeric_comparison_value_event(uint16_t connection_handle,
                                                          uint32_t numeric_value))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB07_06_PRINTF("aci_gap_numeric_comparison_value_event\r\n");
}
/**
  * @brief This event is sent only during SC v.4.2 Pairing, when Keypress Notifications are supported,
  *        in order to show the input type signalled by the peer device, having Keyboard only I/O capabilities.
  *        When this event is received, no action is required to the User.
  * @param connection_handle Connection handle related to the underlying Pairing
  * @param notification_type Type of Keypress input notified/signaled by peer device
  *                          (having Keyboard only I/O capabilities)
  * @retval None
  */
WEAK_FUNCTION(void aci_gap_keypress_notification_event(uint16_t connection_handle,
                                                       uint8_t notification_type))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB07_06_PRINTF("aci_gap_keypress_notification_event\r\n");
}

/**
  * @brief This event is generated to the application by the GATT server when a client modifies any
  *        attribute on the server, as consequence of one of the following GATT procedures:
  *        - write without response
  *        - signed write without response
  *        - write characteristic value
  *        - write long characteristic value
  *        - reliable write.
  * @param connection_handle The connection handle which modified the attribute.
  * @param attr_handle Handle of the attribute that was modified.
  * @param offset SoC mode: the offset is never used and it is always 0. Network coprocessor mode:
  *               - Bits 0-14: offset of the reported value inside the attribute.
  *               - Bit 15: if the entire value of the attribute does not fit inside a single
  *                         ACI_GATT_ATTRIBUTE_MODIFIED_EVENT event, this bit is set to 1 to notify that
  *                         other ACI_GATT_ATTRIBUTE_MODIFIED_EVENT events will follow to report the remaining value.
  * @param attr_data_length Length of attr_data in octets
  * @param attr_data The modified value
  * @retval None
  */
WEAK_FUNCTION(void aci_gatt_attribute_modified_event(uint16_t connection_handle,
                                                     uint16_t attr_handle,
                                                     uint16_t offset,
                                                     uint16_t attr_data_length,
                                                     uint8_t attr_data[]))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB07_06_PRINTF("aci_gatt_attribute_modified_event\r\n");
}
/**
  * @brief This event is generated by the client/server to the application on a GATT timeout (30 seconds).
  *        This is a critical event that should not happen during normal operating conditions.
  *        It is an indication of either a major disruption in the communication link or a mistake
  *        in the application which does not provide a reply to GATT procedures.
  *        After this event, the GATT channel is closed and no more GATT communication can be performed.
  *        The applications is expected to issue an @ref aci_gap_terminate to disconnect from the peer device.
  *        It is important to leave an 100 ms blank window before sending the @ref aci_gap_terminate, since
  *        immediately after this event, system could save important information in non volatile memory.
  * @param connection_handle Connection handle on which the GATT procedure has timed out
  * @retval None
  */
WEAK_FUNCTION(void aci_gatt_proc_timeout_event(uint16_t connection_handle))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB07_06_PRINTF("aci_gatt_proc_timeout_event\r\n");
}
/**
  * @brief This event is generated in response to an Exchange MTU request. See
  *        @ref aci_gatt_exchange_config.
  * @param connection_handle Connection handle related to the response
  * @param server_rx_mtu ATT_MTU value agreed between server and client
  * @retval None
  */
WEAK_FUNCTION(void aci_att_exchange_mtu_resp_event(uint16_t connection_handle,
                                                   uint16_t server_rx_mtu))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB07_06_PRINTF("aci_att_exchange_mtu_resp_event\r\n");
}
/**
  * @brief This event is generated in response to a Find Information Request. See
  *        @ref aci_att_find_info_req and Find Information Response in Bluetooth Core v4.1 spec.
  * @param connection_handle Connection handle related to the response
  * @param format Format of the hanndle-uuid pairs
  * @param event_data_length Length of handle_uuid_pair in octets
  * @param handle_uuid_pair A sequence of handle-uuid pairs. if format=1, each pair is:[2 octets for handle,
  *                         2 octets for UUIDs], if format=2, each pair is:[2 octets for handle, 16 octets for UUIDs]
  * @retval None
  */
WEAK_FUNCTION(void aci_att_find_info_resp_event(uint16_t connection_handle,
                                                uint8_t format,
                                                uint8_t event_data_length,
                                                uint8_t handle_uuid_pair[]))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB07_06_PRINTF("aci_att_find_info_resp_event\r\n");
}
/**
  * @brief This event is generated in response to a @ref aci_att_find_by_type_value_req
  * @param connection_handle Connection handle related to the response
  * @param num_of_handle_pair Number of attribute, group handle pairs
  * @param attr_group_handle_pair See @ref attribute_group_handle_pair_t
  * @retval None
  */
WEAK_FUNCTION(void aci_att_find_by_type_value_resp_event(uint16_t connection_handle,
                                                         uint8_t num_of_handle_pair,
                                                         attribute_group_handle_pair_t attr_group_handle_pair[]))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB07_06_PRINTF("aci_att_find_by_type_value_resp_event\r\n");
}
/**
  * @brief This event is generated in response to a @ref aci_att_read_by_type_req. See
  *        @ref aci_gatt_find_included_services and @ref aci_gatt_disc_all_char_desc.
  * @param connection_handle Connection handle related to the response
  * @param handle_value_pair_length The size of each attribute handle-value pair
  * @param data_length Length of handle_value_pair_data in octets
  * @param handle_value_pair_data Attribute Data List as defined in Bluetooth Core v4.1 spec.
  *                               A sequence of handle-value pairs: [2 octets for Attribute Handle,
  *                               (handle_value_pair_length - 2 octets) for Attribute Value]
  * @retval None
  */
WEAK_FUNCTION(void aci_att_read_by_type_resp_event(uint16_t connection_handle,
                                                   uint8_t handle_value_pair_length,
                                                   uint8_t data_length,
                                                   uint8_t handle_value_pair_data[]))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB07_06_PRINTF("aci_att_read_by_type_resp_event\r\n");
}
/**
  * @brief This event is generated in response to a Read Request. See @ref aci_gatt_read_char_value.
  * @param connection_handle Connection handle related to the response
  * @param event_data_length Length of following data
  * @param attribute_value The value of the attribute.
  * @retval None
  */
WEAK_FUNCTION(void aci_att_read_resp_event(uint16_t connection_handle,
                                           uint8_t event_data_length,
                                           uint8_t attribute_value[]))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB07_06_PRINTF("aci_att_read_resp_event\r\n");
}
/**
  * @brief This event can be generated during a read long characteristic value procedure.
  *        See @ref aci_gatt_read_long_char_value.
  * @param connection_handle Connection handle related to the response
  * @param event_data_length Length of following data
  * @param attribute_value Part of the attribute value.
  * @retval None
  */
WEAK_FUNCTION(void aci_att_read_blob_resp_event(uint16_t connection_handle,
                                                uint8_t event_data_length,
                                                uint8_t attribute_value[]))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB07_06_PRINTF("aci_att_read_blob_resp_event\r\n");
}
/**
  * @brief This event is generated in response to a Read Multiple Request.
  * @param connection_handle Connection handle related to the response
  * @param event_data_length Length of following data
  * @param set_of_values A set of two or more values.
  *                      A concatenation of attribute values for each of the attribute handles
  *                      in the request in the order that they were requested.
  * @retval None
  */
WEAK_FUNCTION(void aci_att_read_multiple_resp_event(uint16_t connection_handle,
                                                    uint8_t event_data_length,
                                                    uint8_t set_of_values[]))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB07_06_PRINTF("aci_att_read_multiple_resp_event\r\n");
}
/**
  * @brief This event is generated in response to a Read By Group Type Request. See
  *        @ref aci_gatt_disc_all_primary_services.
  * @param connection_handle Connection handle related to the response
  * @param Attribute_Data_Length The size of each attribute data
  * @param data_length Length of attribute_data_list in octets
  * @param attribute_data_list Attribute Data List as defined in Bluetooth Core v4.1 spec.
  *                            A sequence of attribute handle, end group handle, attribute value tuples:
  *                            [2 octets for Attribute Handle, 2 octets End Group Handle,
  *                             (Attribute_Data_Length - 4 octets) for Attribute Value]
  * @retval None
  */
WEAK_FUNCTION(void aci_att_read_by_group_type_resp_event(uint16_t connection_handle,
                                                         uint8_t Attribute_Data_Length,
                                                         uint8_t data_length,
                                                         uint8_t attribute_data_list[]))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB07_06_PRINTF("aci_att_read_by_group_type_resp_event\r\n");
}
/**
  * @brief This event is generated in response to a @ref aci_att_prepare_write_req.
  * @param connection_handle Connection handle related to the response
  * @param attribute_handle The handle of the attribute to be written
  * @param offset The offset of the first octet to be written.
  * @param part_attribute_value_length Length of part_attribute_value in octets
  * @param part_attribute_value The value of the attribute to be written
  * @retval None
  */
WEAK_FUNCTION(void aci_att_prepare_write_resp_event(uint16_t connection_handle,
                                                    uint16_t attribute_handle,
                                                    uint16_t offset,
                                                    uint8_t part_attribute_value_length,
                                                    uint8_t part_attribute_value[]))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB07_06_PRINTF("aci_att_prepare_write_resp_event\r\n");
}
/**
  * @brief This event is generated in response to an Execute Write Request.
  * @param connection_handle Connection handle related to the response
  * @retval None
  */
WEAK_FUNCTION(void aci_att_exec_write_resp_event(uint16_t connection_handle))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB07_06_PRINTF("aci_att_exec_write_resp_event\r\n");
}
/**
  * @brief This event is generated when a GATT client procedure completes either with error or
successfully.
  * @param connection_handle Connection handle related to the response
  * @param error_code Indicates whether the procedure completed with an error or was successful
  * Values:
  - 0x00: Success
  - 0x01: Unknown HCI Command
  - 0x02: Unknown Connection Identifier
  - 0x03: Hardware Failure
  - 0x04: Page Timeout
  - 0x05: Authentication Failure
  - 0x06: PIN or Key Missing
  - 0x07: Memory Capacity Exceeded
  - 0x08: Connection Timeout
  - 0x09: Connection Limit Exceeded
  - 0x0A: Synchronous Connection Limit to a Device Exceeded
  - 0x0B: ACL Connection Already Exists
  - 0x0C: Command Disallowed
  - 0x0D: Connection Rejected Due To Limited Resources
  - 0x0E: Connection Rejected Due To Security Reasons
  - 0x0F: Connection Rejected due to Unacceptable BD_ADDR
  - 0x10: Connection Accept Timeout Exceeded
  - 0x11: Unsupported Feature Or Parameter Value
  - 0x12: Invalid HCI Command Parameters
  - 0x13: Remote User Terminated Connection
  - 0x14: Remote Device Terminated Connection due to Low Resources
  - 0x15: Remote Device Terminated Connection due to Power Off
  - 0x16: Connection Terminated By Local Host
  - 0x17: Repeated Attempts
  - 0x18: Pairing Not Allowed
  - 0x19: Unknown LMP PDU
  - 0x1A: Unsupported Remote Feature / Unsupported LMP Feature
  - 0x1B: SCO Offset Rejected
  - 0x1C: SCO Interval Rejected
  - 0x1D: SCO Air Mode Rejected
  - 0x1E: Invalid LMP Parameters
  - 0x1F: Unspecified Error
  - 0x20: Unsupported LMP Parameter Value
  - 0x21: Role Change Not Allowed
  - 0x22: LMP Response Timeout / LL Response Timeout
  - 0x23: LMP Error Transaction Collision
  - 0x24: LMP PDU Not Allowed
  - 0x25: Encryption Mode Not Acceptable
  - 0x26: Link Key cannot be Changed
  - 0x27: Requested QoS Not Supported
  - 0x28: Instant Passed
  - 0x29: Pairing With Unit Key Not Supported
  - 0x2A: Different Transaction Collision
  - 0x2C: QoS Unacceptable Parameter
  - 0x2D: QoS Rejected
  - 0x2E: Channel Assessment Not Supported
  - 0x2F: Insufficient Security
  - 0x30: Parameter Out Of Mandatory Range
  - 0x32: Role Switch Pending
  - 0x34: Reserved Slot Violation
  - 0x35: Role Switch Failed
  - 0x36: Extended Inquiry Response Too Large
  - 0x37: Secure Simple Pairing Not Supported by Host
  - 0x38: Host Busy - Pairing
  - 0x39: Connection Rejected due to No Suitable Channel Found
  - 0x3A: Controller Busy
  - 0x3B: Unacceptable Connection Interval
  - 0x3C: Directed Advertising Timeout
  - 0x3D: Connection Terminated Due to MIC Failure
  - 0x3E: Connection Failed to be Established
  - 0x3F: MAC of the 802.11 AMP
  - 0x41: Failed
  - 0x42: Invalid parameters
  - 0x43: Busy
  - 0x44: Invalid length
  - 0x45: Pending
  - 0x46: Not allowed
  - 0x47: GATT error
  - 0x48: Address not resolved
  - 0x50: Invalid CID
  - 0x5A: CSRK not found
  - 0x5B: IRK not found
  - 0x5C: Device not found in DB
  - 0x5D: Security DB full
  - 0x5E: Device not bonded
  - 0x5F: Device in blacklist
  - 0x60: Invalid handle
  - 0x61: Invalid parameter
  - 0x62: Out of handles
  - 0x63: Invalid operation
  - 0x64: Insufficient resources
  - 0x65: Insufficient encryption key size
  - 0x66: Characteristic already exist
  - 0x82: No valid slot
  - 0x83: Short window
  - 0x84: New interval failed
  - 0x85: Too large interval
  - 0x86: Slot length failed
  - 0xFA: Flash read failed
  - 0xFB: Flash write failed
  - 0xFC: Flash erase failed
  * @retval None
  */
WEAK_FUNCTION(void aci_gatt_proc_complete_event(uint16_t connection_handle,
                                                uint8_t error_code))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB07_06_PRINTF("aci_gatt_proc_complete_event\r\n");
}
/**
  * @brief This event is generated when an Error Response is received from the server. The error
response can be given by the server at the end of one of the GATT discovery procedures.
This does not mean that the procedure ended with an error, but this error event is part of the
procedure itself.
  * @param connection_handle Connection handle related to the response
  * @param req_op_code The request that generated this error response
  * @param attribute_handle The attribute handle that generated this error response
  * @param error_code The reason why the request has generated an error response (ATT error codes)
  * Values:
  - 0x01: Invalid handle
  - 0x02: Read not permitted
  - 0x03: Write not permitted
  - 0x04: Invalid PDU
  - 0x05: Insufficient authentication
  - 0x06: Request not supported
  - 0x07: Invalid offset
  - 0x08: Insufficient authorization
  - 0x09: Prepare queue full
  - 0x0A: Attribute not found
  - 0x0B: Attribute not long
  - 0x0C: Insufficient encryption key size
  - 0x0D: Invalid attribute value length
  - 0x0E: Unlikely error
  - 0x0F: Insufficient encryption
  - 0x10: Unsupported group type
  - 0x11: Insufficient resources
  * @retval None
  */
WEAK_FUNCTION(void aci_gatt_error_resp_event(uint16_t connection_handle,
                                             uint8_t req_op_code,
                                             uint16_t attribute_handle,
                                             uint8_t error_code))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB07_06_PRINTF("aci_gatt_error_resp_event\r\n");
}
/**
  * @brief This event can be generated during a "Discover Characteristics By UUID" procedure or a
  *        "Read using Characteristic UUID" procedure.
  *        The attribute value will be a service declaration as defined in Bluetooth Core v4.1spec
  *        (vol.3, Part G, ch. 3.3.1), when a "Discover Characteristics By UUID" has been started. It will
  *        be the value of the Characteristic if a* "Read using Characteristic UUID" has been
  *        performed.
  * @param connection_handle Connection handle related to the response
  * @param attribute_handle The handle of the attribute
  * @param attribute_value_length Length of attribute_value in octets
  * @param attribute_value The attribute value will be a service declaration as defined in Bluetooth Core v4.0 spec
  *        (vol.3, Part G, ch. 3.3.1), when a "Discover Characteristics By UUID" has been started.
  *        It will be the value of the Characteristic if a "Read using Characteristic UUID" has been performed.
  * @retval None
  */
WEAK_FUNCTION(void aci_gatt_disc_read_char_by_uuid_resp_event(uint16_t connection_handle,
                                                              uint16_t attribute_handle,
                                                              uint8_t attribute_value_length,
                                                              uint8_t attribute_value[]))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB07_06_PRINTF("aci_gatt_disc_read_char_by_uuid_resp_event\r\n");
}
/**
  * @brief This event is given to the application when a write request, write command or signed write
  *        command is received by the server from the client. This event will be given to the application
  *        only if the event bit for this event generation is set when the characteristic was added.
  *        When this event is received, the application has to check whether the value being requested
  *        for write can be allowed to be written and respond with the command @ref aci_gatt_write_resp.
  *        The details of the parameters of the command can be found. Based on the response from
  *        the application, the attribute value will be modified by the stack. If the write is rejected by the
  *        application, then the value of the attribute will not be modified. In case of a write REQ, an
  *        error response will be sent to the client, with the error code as specified by the application.
  *        In case of write/signed write commands, no response is sent to the client but the attribute is
  *        not modified.
  * @param connection_handle Handle of the connection on which there was the request to write the attribute
  * @param attribute_handle The handle of the attribute
  * @param data_length Length of Data field
  * @param data The data that the client has requested to write
  * @retval None
  */
WEAK_FUNCTION(void aci_gatt_write_permit_req_event(uint16_t connection_handle,
                                                   uint16_t attribute_handle,
                                                   uint8_t data_length,
                                                   uint8_t data[]))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB07_06_PRINTF("aci_gatt_write_permit_req_event\r\n");
}
/**
  * @brief This event is given to the application when a read request or read blob request is received
  *        by the server from the client. This event will be given to the application only if the event bit
  *        for this event generation is set when the characteristic was added.
  *        On receiving this event, the application can update the value of the handle if it desires and
  *        when done, it has to send the @ref aci_gatt_allow_read command to indicate to the stack that it
  *        can send the response to the client.
  * @param connection_handle Connection handle related to the response
  * @param attribute_handle The handle of the attribute
  * @param offset Contains the offset from which the read has been requested
  * @retval None
  */
WEAK_FUNCTION(void aci_gatt_read_permit_req_event(uint16_t connection_handle,
                                                  uint16_t attribute_handle,
