zdavatz/fp-sns-stbox1/Middlewares/ST/STM32WB07_06/hci/stm32wb07_06_events_cb.c
                                                  uint16_t offset))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB07_06_PRINTF("aci_gatt_read_permit_req_event\r\n");
}
/**
  * @brief Each time BLE FW stack raises the error code @ref ble_status_insufficient_resources (0x64),
the @ref aci_gatt_tx_pool_available_event event is generated as soon as the available buffer size
is greater than maximum ATT MTU (on stack versions below v2.1 this event is generated when at least 2 packets
with MTU of 23 bytes are available).
  * @param connection_handle Connection handle related to the request
  * @param available_buffers Not used.
  * @retval None
  */
WEAK_FUNCTION(void aci_gatt_tx_pool_available_event(uint16_t connection_handle,
                                                    uint16_t available_buffers))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB07_06_PRINTF("aci_gatt_tx_pool_available_event\r\n");
}
/**
  * @brief This event is generated when the client has sent the confirmation to a previously sent indication
  * @param connection_handle Connection handle related to the event
  * @retval None
  */
WEAK_FUNCTION(void aci_gatt_server_confirmation_event(uint16_t connection_handle))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB07_06_PRINTF("aci_gatt_server_confirmation_event\r\n");
}
/**
  * @brief This event is given to the application when a prepare write request
  *        is received by the server from the client. This event will be given to the application
  *        only if the event bit for this event generation is set when the characteristic was added.
  *        When this event is received, the application has to check whether the value being requested
  *        for write can be allowed to be written and respond with the command @ref aci_gatt_write_resp.
  *        Based on the response from the application, the attribute value will be modified by the stack.
  *        If the write is rejected by the application, then the value of the attribute will not be modified
  *        and an error response will be sent to the client, with the error code as specified by the application.
  * @param connection_handle Handle of the connection on which there was the request to write the attribute
  * @param attribute_handle The handle of the attribute
  * @param offset The offset from which the prepare write has been requested
  * @param data_length Length of Data field
  * @param data The data that the client has requested to write
  * @retval None
  */
WEAK_FUNCTION(void aci_gatt_prepare_write_permit_req_event(uint16_t connection_handle,
                                                           uint16_t attribute_handle,
                                                           uint16_t offset,
                                                           uint8_t data_length,
                                                           uint8_t data[]))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB07_06_PRINTF("aci_gatt_prepare_write_permit_req_event\r\n");
}
/**
  * @}
  */
/**
  *@defgroup ACI_L2CAP_events ACI L2CAP events
  *@brief ACI L2CAP events layer.
  *@{
  */
/* ACI L2CAP events */
/**
  * @brief This event is generated when the master responds to the connection update request packet
with a connection update response packet.
  * @param connection_handle Connection handle referring to the COS Channel where the Disconnection has been received.
  * @param result
  * @retval None
  */
WEAK_FUNCTION(void aci_l2cap_connection_update_resp_event(uint16_t connection_handle,
                                                          uint16_t result))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB07_06_PRINTF("aci_l2cap_connection_update_resp_event\r\n");
}
/**
  * @brief This event is generated when the master does not respond to the connection update
request packet with a connection update response packet or a command reject packet
within 30 seconds.
  * @param connection_handle Handle of the connection related to this
L2CAP procedure.
  * @param data_length Length of following data
  * @param data
  * @retval None
  */
WEAK_FUNCTION(void aci_l2cap_proc_timeout_event(uint16_t connection_handle,
                                                uint8_t data_length,
                                                uint8_t data[]))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB07_06_PRINTF("aci_l2cap_proc_timeout_event\r\n");
}
/**
  * @brief The event is given by the L2CAP layer when a connection update request is received from
the slave. The upper layer which receives this event has to respond by sending a
@ref aci_l2cap_connection_parameter_update_resp command.
  * @param connection_handle Handle of the connection related to this
L2CAP procedure.
  * @param identifier This is the identifier which associate the request to the
response.
  * @param l2_cap_length Length of the L2CAP connection update request.
  * @param interval_min Minimum value for the connection event interval. This shall be less
than or equal to conn_interval_max.
Time = N * 1.25 msec.
  * Values:
  - 0x0006 (7.50 ms)  ... 0x0C80 (4000.00 ms)
  * @param interval_max Maximum value for the connection event interval. This shall be
greater than or equal to conn_interval_min.
Time = N * 1.25 msec.
  * Values:
  - 0x0006 (7.50 ms)  ... 0x0C80 (4000.00 ms)
  * @param slave_latency Slave latency for the connection in number of connection events.
  * Values:
  - 0x0000 ... 0x01F3
  * @param timeout_multiplier Defines connection timeout parameter in the following manner: Timeout Multiplier * 10ms.
  * @retval None
  */
WEAK_FUNCTION(void aci_l2cap_connection_update_req_event(uint16_t connection_handle,
                                                         uint8_t identifier,
                                                         uint16_t l2_cap_length,
                                                         uint16_t interval_min,
                                                         uint16_t interval_max,
                                                         uint16_t slave_latency,
                                                         uint16_t timeout_multiplier))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB07_06_PRINTF("aci_l2cap_connection_update_req_event\r\n");
}
/**
  * @brief This event is generated when the master responds to the connection update request packet
with a command reject packet.
  * @param connection_handle Connection handle referring to the COS Channel where the Disconnection has been received.
  * @param identifier This is the identifier which associate the request to the
response.
  * @param reason reason
  * @param data_length Length of following data
  * @param data Data field associated with reason
  * @retval None
  */
WEAK_FUNCTION(void aci_l2cap_command_reject_event(uint16_t connection_handle,
                                                  uint8_t identifier,
                                                  uint16_t reason,
                                                  uint8_t data_length,
                                                  uint8_t data[]))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB07_06_PRINTF("aci_l2cap_command_reject_event\r\n");
}
/**
  * @}
  */
/**
  *@defgroup ACI_HAL_events ACI HAL events
  *@brief ACI HAL events layer.
  *@{
  */
/* ACI HAL events */
/**
  * @brief This event inform the application that the network coprocessor has been reset.
  *        If the reason code is a system crash, a following event @ref aci_blue_crash_info_event
  *        will provide more information regarding the system crash details.
  * @param reason_code reason code describing why device was reset and in which mode is operating
  *                    (Updater or Normal mode)
  *                    Values:
  *                    - 0x01: Firmware started properly
  *                    - 0x02: Updater mode entered with ACI command
  *                    - 0x03: Updater mode entered due to bad Blue Flag
  *                    - 0x04: Updater mode entered due to IRQ pin
  *                    - 0x05: System reset due to watchdog
  *                    - 0x06: System reset due to lockup
  *                    - 0x07: System reset due to brownout reset
  *                    - 0x08: System reset due to crash
  *                    - 0x09: System reset due to ECC error
  * @retval None
  */
WEAK_FUNCTION(void aci_blue_initialized_event(uint8_t reason_code))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB07_06_PRINTF("aci_blue_initialized_event reason_code=%x\r\n", reason_code);
}
/**
  * @brief 'This event is generated when an overflow occurs in the event queue read by the
external microcontroller. This is normally caused when the external microcontroller does
not read pending events. The returned bitmap indicates which event has been lost. Please
 note that one bit set to 1 indicates one or more occurrences of the particular events.
The event ACI_BLUE_EVENTS_LOST_EVENT cannot be lost and it will inserted in the
event queue as soon as a position is freed in the event queue. This event should not happen under normal
operating condition where external microcontroller promptly reads events signaled by IRQ pin.
It is provided to detected unexpected behavior of the external microcontroller or to
allow application to recover situations where critical events are lost.
  * @param lost_events Bitmap of lost events. Each bit indicates one or more occurrences of the specific event.
  * Flags:
  - 0x0000000000000001: HCI_DISCONNECTION_COMPLETE_EVENT
  - 0x0000000000000002: HCI_ENCRYPTION_CHANGE_EVENT
  - 0x0000000000000004: HCI_READ_REMOTE_VERSION_INFORMATION_COMPLETE_EVENT
  - 0x0000000000000008: HCI_COMMAND_COMPLETE_EVENT
  - 0x0000000000000010: HCI_COMMAND_STATUS_EVENT
  - 0x0000000000000020: HCI_HARDWARE_ERROR_EVENT
  - 0x0000000000000040: HCI_NUMBER_OF_COMPLETED_PACKETS_EVENT
  - 0x0000000000000080: HCI_ENCRYPTION_KEY_REFRESH_COMPLETE_EVENT
  - 0x0000000000000100: ACI_BLUE_INITIALIZED_EVENT
  - 0x0000000000000200: ACI_GAP_LIMITED_DISCOVERABLE_EVENT
  - 0x0000000000000400: ACI_GAP_PAIRING_COMPLETE_EVENT
  - 0x0000000000000800: ACI_GAP_PASS_KEY_REQ_EVENT
  - 0x0000000000001000: ACI_GAP_AUTHORIZATION_REQ_EVENT
  - 0x0000000000002000: ACI_GAP_SLAVE_SECURITY_INITIATED_EVENT
  - 0x0000000000004000: ACI_GAP_BOND_LOST_EVENT
  - 0x0000000000008000: ACI_GAP_PROC_COMPLETE_EVENT
  - 0x0000000000010000: ACI_GAP_ADDR_NOT_RESOLVED_EVENT
  - 0x0000000000020000: ACI_L2CAP_CONNECTION_UPDATE_RESP_EVENT
  - 0x0000000000040000: ACI_L2CAP_PROC_TIMEOUT_EVENT
  - 0x0000000000080000: ACI_L2CAP_CONNECTION_UPDATE_REQ_EVENT
  - 0x0000000000100000: ACI_GATT_ATTRIBUTE_MODIFIED_EVENT
  - 0x0000000000200000: ACI_GATT_PROC_TIMEOUT_EVENT
  - 0x0000000000400000: ACI_ATT_EXCHANGE_MTU_RESP_EVENT
  - 0x0000000000800000: ACI_ATT_FIND_INFO_RESP_EVENT
  - 0x0000000001000000: ACI_ATT_FIND_BY_TYPE_VALUE_RESP_EVENT
  - 0x0000000002000000: ACI_ATT_READ_BY_TYPE_RESP_EVENT
  - 0x0000000004000000: ACI_ATT_READ_RESP_EVENT
  - 0x0000000008000000: ACI_ATT_READ_BLOB_RESP_EVENT
  - 0x0000000010000000: ACI_ATT_READ_MULTIPLE_RESP_EVENT
  - 0x0000000020000000: ACI_ATT_READ_BY_GROUP_TYPE_RESP_EVENT
  - 0x0000000040000000: ACI_ATT_WRITE_RESP_EVENT
  - 0x0000000080000000: ACI_ATT_PREPARE_WRITE_RESP_EVENT
  - 0x0000000100000000: ACI_ATT_EXEC_WRITE_RESP_EVENT
  - 0x0000000200000000: ACI_GATT_INDICATION_EVENT
  - 0x0000000400000000: ACI_GATT_NOTIFICATION_EVENT
  - 0x0000000800000000: ACI_GATT_PROC_COMPLETE_EVENT
  - 0x0000001000000000: ACI_GATT_ERROR_RESP_EVENT
  - 0x0000002000000000: ACI_GATT_DISC_READ_CHAR_BY_UUID_RESP_EVENT
  - 0x0000004000000000: ACI_GATT_WRITE_PERMIT_REQ_EVENT
  - 0x0000008000000000: ACI_GATT_READ_PERMIT_REQ_EVENT
  - 0x0000010000000000: ACI_GATT_READ_MULTI_PERMIT_REQ_EVENT
  - 0x0000020000000000: ACI_GATT_TX_POOL_AVAILABLE_EVENT
  - 0x0000040000000000: ACI_GATT_SERVER_CONFIRMATION_EVENT
  - 0x0000080000000000: ACI_GATT_PREPARE_WRITE_PERMIT_REQ_EVENT
  - 0x0000100000000000: HCI_LE_CONNECTION_COMPLETE_EVENT
  - 0x0000200000000000: HCI_LE_ADVERTISING_REPORT_EVENT
  - 0x0000400000000000: HCI_LE_CONNECTION_UPDATE_COMPLETE_EVENT
  - 0x0000800000000000: HCI_LE_READ_REMOTE_USED_FEATURES_COMPLETE_EVENT
  - 0x0001000000000000: HCI_LE_LONG_TERM_KEY_REQUEST_EVENT
  - 0x0002000000000000: HCI_LE_DATA_LENGTH_CHANGE_EVENT
  - 0x0004000000000000: HCI_LE_READ_LOCAL_P256_PUBLIC_KEY_COMPLETE_EVENT
  - 0x0008000000000000: HCI_LE_GENERATE_DHKEY_COMPLETE_EVENT
  - 0x0010000000000000: HCI_LE_ENHANCED_CONNECTION_COMPLETE_EVENT
  - 0x0020000000000000: HCI_LE_DIRECT_ADVERTISING_REPORT_EVENT
  - 0x0040000000000000: ACI_GAP_NUMERIC_COMPARISON_VALUE_EVENT
  - 0x0080000000000000: ACI_GAP_KEYPRESS_NOTIFICATION_EVENT
  * @retval None
  */
WEAK_FUNCTION(void aci_blue_events_lost_event(uint8_t lost_events[8]))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB07_06_PRINTF("aci_blue_events_lost_event\r\n");
}
/**
  * @brief 'This event is given to the application after the @ref aci_blue_initialized_event
when a system crash is detected. This events returns system crash information for debugging purposes.
Information reported are useful to understand the root cause of the crash.
  * @param crash_type Crash type
  * Values:
  - 0x00: Assert failed
  - 0x01: NMI fault
  - 0x02: Hard fault
  * @param sp Stack pointer
  * @param r0 Register r0
  * @param r1 Register r1
  * @param r2 Register r2
  * @param r3 Register r3
  * @param r12 Register r12
  * @param lr Link register
  * @param pc Program counter where crash occurred
  * @param x_psr x_psr register
  * @param debug_data_length Length of debug_data field
  * @param debug_data Debug data
  * @retval None
  */
WEAK_FUNCTION(void aci_blue_crash_info_event(uint8_t crash_type,
                                             uint32_t sp,
                                             uint32_t r0,
                                             uint32_t r1,
                                             uint32_t r2,
                                             uint32_t r3,
                                             uint32_t r12,
                                             uint32_t lr,
                                             uint32_t pc,
                                             uint32_t x_psr,
                                             uint8_t debug_data_length,
                                             uint8_t debug_data[]))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB07_06_PRINTF("aci_blue_crash_info_event\r\n");
}
/**
  * @brief 'This event is generated when the device completes a radio activity and provide information when
  *        a new radio activity will be performed.
  *        Informtation provided includes type of radio activity and absolute time in system ticks when a new
  *        radio activity is schedule, if any. Application can use this information to schedule user activities
  *        synchronous to selected radio activitities. A command @ref aci_hal_set_radio_activity_mask is provided
  *        to enable radio activity events of user interests, by default no events are enabled.
  *        User should take into account that enablinng radio events in application with intense radio activity
  *        could lead to a fairly high rate of events generated.
  *        Application use cases includes synchronizing notification with connection interval, switiching antenna
  *        at the end of advertising or performing flash erase operation while radio is idle.
  * @param last_state Completed radio events
  *        Values:
  *        - 0x00: Idle
  *        - 0x01: Advertising
  *        - 0x02: Connection event slave
  *        - 0x03: Scanning
  *        - 0x04: Connection request
  *        - 0x05: Connection event master
  *        - 0x06: TX test mode
  *        - 0x07: RX test mode
  * @param next_state Incoming radio events
  *        Values:
  *        - 0x00: Idle
  *        - 0x01: Advertising
  *        - 0x02: Connection event slave
  *        - 0x03: Scanning
  *        - 0x04: Connection request
  *        - 0x05: Connection event master
  *        - 0x06: TX test mode
  *        - 0x07: RX test mode
  * @param next_state_sys_time 32bit absolute current time expressed in internal time units.
  * @retval None
  */
WEAK_FUNCTION(void aci_hal_end_of_radio_activity_event(uint8_t last_state,
                                                       uint8_t next_state,
                                                       uint32_t next_state_sys_time))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB07_06_PRINTF("aci_hal_end_of_radio_activity_event\r\n");
}
/**
  * @brief This event is reported to the application after a scan request is received and a scan response
is scheduled to be transmitted.
  * @param rssi N Size: 1 Octet (signed integer)
Units: dBm
  * Values:
  - 127: RSSI not available
  - -127 ... 20
  * @param peer_address_type 0x00 Public Device Address
0x01 Random Device Address
0x02 Public Identity Address (Corresponds to Resolved Private Address)
0x03 Random (Static) Identity Address (Corresponds to Resolved Private Address)
  * Values:
  - 0x00: Public Device Address
  - 0x01: Random Device Address
  - 0x02: Public Identity Address
  - 0x03: Random (Static) Identity Address
  * @param peer_address Public Device Address or Random Device Address of the peer device
  * @retval None
  */
WEAK_FUNCTION(void aci_hal_scan_req_report_event(int8_t rssi,
                                                 uint8_t peer_address_type,
                                                 uint8_t peer_address[6]))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB07_06_PRINTF("aci_hal_scan_req_report_event\r\n");
}
/**
  * @brief This event is generated to report firmware error information.
  * @param fw_error_type FW Error type
  * Values:
  - 0x01: L2CAP recombination failure
  * @param data_length Length of Data in octets
  * @param data The error event info
  * @retval None
  */
WEAK_FUNCTION(void aci_hal_fw_error_event(uint8_t fw_error_type,
                                          uint8_t data_length,
                                          uint8_t data[]))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB07_06_PRINTF("aci_hal_fw_error_event\r\n");
}
/**
  * @brief This event is generated when the amount of transmitted test packets
  *        specified with aci_hal_transmitter_test_packets() has been reached.
  * @param number_of_packets The number of test packets actually transmitted.
  * @retval None
  */
WEAK_FUNCTION(void aci_hal_le_test_end_event(uint16_t number_of_packets))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB07_06_PRINTF("aci_hal_le_test_end_event\r\n");
}
/**
  * @brief Event generated when a request or a response is received from the peer
  *        to create an L2CAP channel.
  * @param connection_handle Connection handle that identifies the connection.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @param event_type
  *        Values:
  *        - 0x00: L2CAP_CONN_REQ
  *        - 0x01: L2CAP_CONN_RESP
  * @param result Result of the connection request if event_type is
  *        L2CAP_CONN_RESP. To be ignored if event_type is L2CAP_CONN_REQ.
  *        Values:
  *        - 0x0000: L2CAP_CONN_SUCCESSFUL
  *        - 0x0002: L2CAP_SPSM_NOT_SUPPORTED
  *        - 0x0004: L2CAP_NO_RESOURCE_AVAILABLE
  *        - 0x0005: L2CAP_INSUFFICIENT_AUTHENTICATION
  *        - 0x0006: L2CAP_INSUFFICIENT_AUTHORIZATION
  *        - 0x0007: L2CAP_INSUFFICIENT_ENCRYPTION_KEY_SIZE
  *        - 0x0008: L2CAP_INSUFFICIENT_ENCRYPTION
  *        - 0x0009: L2CAP_INVALID_SOURCE_CID
  *        - 0x000A: L2CAP_SOURCE_CID_ALREADY_ALLOCATED
  *        - 0x000B: L2CAP_UNACCEPTABLE_PARAMETERS
  * @param identifier This is the identifier which associates the request to the
  *        response.
  * @param spsm Simplified Protocol/Service Multiplexer
  *        Values:
  *        - 0x0001 ... 0x00FF
  * @param cid The local channel endpoint that identifies the L2CAP channel. To
  *        be ignored if event_type is L2CAP_CONN_REQ.
  * @param remote_cid The channel endpoint on the remote device.
  * @param peer_mtu The maximum SDU size (in octets) that the L2CAP layer entity
  *        sending the L2CAP_LE_CREDIT_BASED_CONNECTION_REQ can receive on this
  *        channel.
  *        Values:
  *        - 23 ... 65535
  * @param peer_mps The maximum PDU payload size (in octets) that the L2CAP layer
  *        entity sending the L2CAP_LE_CREDIT_BASED_CONNECTION_REQ is capable of
  *        receiving on this channel.
  *        Values:
  *        - 23 ... 65535
  * @param initial_credits The number of K-frames that the peer device can send
  *        to the L2CAP layer entity as soon as the L2CAP channel is established.
  * @retval None
  */
WEAK_FUNCTION(void aci_l2cap_cfc_connection_event(uint16_t connection_handle,
                                                  uint8_t event_type,
                                                  uint16_t result,
                                                  uint8_t identifier,
                                                  uint16_t spsm,
                                                  uint16_t cid,
                                                  uint16_t remote_cid,
                                                  uint16_t peer_mtu,
                                                  uint16_t peer_mps,
                                                  uint16_t initial_credits))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB07_06_PRINTF("aci_l2cap_cfc_connection_event\r\n");
}
/**
  * @brief Event raised when an L2CAP channel using LE Credit Based Flow Control
  *        mode is terminated.
  * @param connection_handle Handle identifying the connection.
  * @param cid The local channel endpoint that identifies the L2CAP channel.
  * @retval None
  */
WEAK_FUNCTION(void aci_l2cap_disconnection_complete_event(uint16_t connection_handle,
                                                          uint16_t cid))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB07_06_PRINTF("aci_l2cap_disconnection_complete_event\r\n");
}
/**
  * @brief Events raised when an L2CAP_FLOW_CONTROL_CREDIT_IND is received from
  *        the peer, which means that it is capable of receiving additional
  *        K-frames (for example after it has processed one or more K-frames) in
