zdavatz/fp-sns-stbox1/Middlewares/ST/STM32WB07_06/hci/stm32wb07_06_events_cb.c
  *                sampling points
  *        - 0x02: CRC was incorrect but the Controller has determined the position and length of the Constant
  *                Tone Extension in some other way
  *        - 0xFF: Insufficient resources to sample (channel_index, cte_type, and slot_durations invalid).
  * @param connection_event_counter The value of connEventCounter (see [Vol 6]
  *        Part B, Section 4.5.1) for the reported PDU
  * @param sample_count
  *        Values:
  *        - 0x00: No samples provided (only permitted if packet_status is 0xFF).
  *        - 0x09 ... 0x52: Total number of sample pairs (there shall be the same number of I samples and Q samples).
  *                         Note: This number is dependent on the switch and sample slot durations used.
  * @param Samples See @ref samples_t
  * @retval None
  */
WEAK_FUNCTION(void hci_le_connection_iq_report_event(uint16_t connection_handle,
                                                     uint8_t rx_phy,
                                                     uint8_t data_channel_index,
                                                     int16_t rssi,
                                                     uint8_t rssi_antenna_id,
                                                     uint8_t cte_type,
                                                     uint8_t slot_durations,
                                                     uint8_t packet_status,
                                                     uint16_t connection_event_counter,
                                                     uint8_t sample_count,
                                                     samples_t Samples[]))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB07_06_PRINTF("hci_le_connection_iq_report_event\r\n");
}
/**
  * @brief This event is used by the Controller to report an issue following a
  *        request to a peer device to reply with a packet containing an
  *        LL_CTE_RSP PDU and a Constant Tone Extension. It shall be generated if
  *        the packet containing the LL_CTE_RSP PDU sent in response did not
  *        contain a Constant Tone Extension or if the peer rejected the request.
  *        It shall not be generated if the packet containing the LL_CTE_RSP PDU
  *        had a CRC error or if the procedure response timeout timer (see [Vol
  *        6] Part B, Section 5.2) expired.
  * @param status For standard error codes see Bluetooth specification, Vol. 2,
  *        part D. For proprietary error code refer to Error codes section
  * @param connection_handle Connection handle that identifies the connection.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @retval None
  */
WEAK_FUNCTION(void hci_le_cte_request_failed_event(uint8_t status,
                                                   uint16_t connection_handle))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB07_06_PRINTF("hci_le_cte_request_failed_event\r\n");
}
/**
  * @brief The HCI_LE_Periodic_Advertising_Sync_Transfer_Received event is used
  *        by the Controller to report that it has received periodic advertising
  *        synchronization information from the device referred to by the
  *        connection_handle parameter and either successfully synchronized to
  *        the periodic advertising train or timed out while attempting to
  *        synchronize. The status will be zero if it successfully synchronized
  *        and non-zero otherwise. The service_data value is provided by the Host
  *        of the device sending the information. The sync_handle identifies the
  *        periodic advertising in subsequent commands and events and shall be
  *        assigned by the Controller. The remaining parameters provide
  *        information about the periodic advertising (see Section 7.7.65.14). If
  *        status is non-zero, all parameter values are valid except sync_handle,
  *        which the Host shall ignore. Note: If the Controller is already
  *        synchronized to the periodic advertising train described in the
  *        received information, no event will be generated.
  * @param status For standard error codes see Bluetooth specification, Vol. 2,
  *        part D. For proprietary error code refer to Error codes section
  * @param connection_handle Connection handle that identifies the connection.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @param service_data A value provided by the peer device
  * @param sync_handle Sync handle that identifies the synchronization
  *        information about the periodic advertising train.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @param advertising_sid
  *        Values:
  *        - 0x00 ... 0x0F: Value of the Advertising SID used to advertise the periodic advertising
  * @param advertiser_address_type
  *        Values:
  *        - 0x00: Public Device Address or Public Identity Address
  *        - 0x01: Random Device Address or Random (static) Identity Address
  *        - 0x02: Public Identity Address (corresponds to Resolved Private Address)
  *        - 0x03: Random (static) Identity Address (corresponds to Resolved Private Address)
  * @param advertising_address Public Device Address, Random Device Address,
  *        Public Identity Address, or Random (static) Identity Address of the
  *        advertiser
  * @param advertiser_phy
  *        Values:
  *        - 0x01: Advertiser PHY is LE 1M
  *        - 0x02: Advertiser PHY is LE 2M
  *        - 0x03: Advertiser PHY is LE Coded
  * @param periodic_advertising_interval Periodic advertising interval. Time = N
  *        * 1.25 ms; Time Range: 7.5ms to 81.91875 s.
  *        Values:
  *        - 0x0006 (7.50 ms)  ... 0xFFFF (NaN) : Periodic advertising interval
  * @param advertiser_clock_accuracy Advertiser Clock Accuracy
  *        Values:
  *        - 0x00: 500 ppm
  *        - 0x01: 250 ppm
  *        - 0x02: 150 ppm
  *        - 0x03: 100 ppm
  *        - 0x04: 75 ppm
  *        - 0x05: 60 ppm
  *        - 0x06: 30 ppm
  *        - 0x07: 20 ppm
  * @retval None
  */
WEAK_FUNCTION(void hci_le_periodic_advertising_sync_transfer_received_event(uint8_t status,
                                                                            uint16_t connection_handle,
                                                                            uint16_t service_data,
                                                                            uint16_t sync_handle,
                                                                            uint8_t advertising_sid,
                                                                            uint8_t advertiser_address_type,
                                                                            uint8_t advertising_address[6],
                                                                            uint8_t advertiser_phy,
                                                                            uint16_t periodic_advertising_interval,
                                                                            uint8_t advertiser_clock_accuracy))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB07_06_PRINTF("hci_le_periodic_advertising_sync_transfer_received_event\r\n");
}
/**
  * @brief Report a path loss threshold crossing on the ACL connection identified
  *        by the connection_handle parameter.
  * @param connection_handle Connection handle that identifies the connection.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @param current_path_loss Current path loss (always zero or positive). Units:
  *        dB.
  *        Values:
  *        - 255: NA
  *        - 0 ... 254
  * @param zone_entered The zone_entered parameter indicates which zone was
  *        entered.
  *        Values:
  *        - 0x00: LOW_ZONE
  *        - 0x01: MIDDLE_ZONE
  *        - 0x02: HIGH_ZONE
  * @retval None
  */
WEAK_FUNCTION(void hci_le_path_loss_threshold_event(uint16_t connection_handle,
                                                    uint8_t current_path_loss,
                                                    uint8_t zone_entered))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB07_06_PRINTF("hci_le_path_loss_threshold_event\r\n");
}
/**
  * @brief Report the transmit power level on the ACL connection identified by
  *        the connection_handle parameter.
  * @param status For standard error codes see Bluetooth specification, Vol. 2,
  *        part D. For proprietary error code refer to Error codes section
  * @param connection_handle Connection handle that identifies the connection.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @param reason The reason why the event was sent and the device whose transmit
  *        power level is being reported. - 0x00: Local transmit power changed -
  *        0x01: Remote transmit power changed - 0x02:
  *        HCI_LE_Read_Remote_Transmit_Power_Level command completed
  *        Values:
  *        - 0x00: LOCAL_TX_POWER_CHANGE
  *        - 0x01: REMOTE_TX_POWER_CHANGE
  *        - 0x02: READ_REMOTE_TX_POWER_COMPLETE
  * @param phy PHY associated with the connection  (not necessarily the currently
  *        used one).
  *        Values:
  *        - 0x01: LE_1M_PHY
  *        - 0x02: LE_2M_PHY
  *        - 0x03: LE_CODED_PHY_S8
  *        - 0x04: LE_CODED_PHY_S2
  * @param transmit_power_level The transmit power level for the PHY (dBm).
  *        Values:
  *        - 126: POWER_NOT_MANAGED
  *        - 127: POWER_NA
  *        - -127 ... 20
  * @param Transmit_Power_Level_Flag It indicates whether the transmit power
  *        level that is being reported has reached its minimum and/or maximum
  *        level. Transmit_Power_Level_Flag shall be ignored if the
  *        transmit_power_level parameter is set to 0x7E or 0x7F.
  *        Flags:
  *        - 0x01: MIN_TX_POWER_BIT
  *        - 0x02: MAX_TX_POWER_BIT
  * @param delta The Delta parameter is set to the change in power level for the
  *        transmitter being reported, whenever it changes its transmit power
  *        level. Delta shall be ignored if the transmit_power_level parameter is
  *        set to 0x7E.
  *        Values:
  *        - 127: NA
  *        - 0 ... 126
  * @retval None
  */
WEAK_FUNCTION(void hci_le_transmit_power_reporting_event(uint8_t status,
                                                         uint16_t connection_handle,
                                                         uint8_t reason,
                                                         uint8_t phy,
                                                         int8_t transmit_power_level,
                                                         uint8_t Transmit_Power_Level_Flag,
                                                         int8_t delta))
{
  /* NOTE : This function Should not be modified, when needed,
            the callback could be implemented in the user file
   */
  STM32WB07_06_PRINTF("hci_le_transmit_power_reporting_event\r\n");
}
/**
  * @}
  */

